# 데이터 구조 다루기

* DataFrame 생성 및 구조 이해 (DataFrame, Series) 
* 열(Column) 및 행(Row) 접근, 수정, 삭제
> df['column']<br>
> df.loc[], df.iloc[]<br>
> df.drop()

# DataFrame

In [1]:
import pandas as pd

# 예제 데이터 생성
data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'age': [25, 30, 35, 40],
    'city': ['Seoul', 'Busan', 'Incheon', 'Daegu']
}

df = pd.DataFrame(data)
print(df)

      name  age     city
0    Alice   25    Seoul
1      Bob   30    Busan
2  Charlie   35  Incheon
3    David   40    Daegu

In [3]:
#다른 방법 
list = [['Alice',25,'Seoul'],['Bob',30,'Busan'],['Bob',30,'Busan'],['Charlie',35,'Incheon']]

df = pd.DataFrame(list,columns = ['name','age', 'city']) 
df.head()

      name  age     city
0    Alice   25    Seoul
1      Bob   30    Busan
2      Bob   30    Busan
3  Charlie   35  Incheon

# Series

In [4]:
list1 = [40,50,60,30,20,40]
ps = pd.Series(list1) 
ps

0    40
1    50
2    60
3    30
4    20
5    40
dtype: int64

In [5]:
list1 = [40,50,60,30,20,40]
indexs = ['Alice','Kim','James','Ann','Kelly','Skye']
ps = pd.Series(list1,index = indexs) 
ps

Alice    40
Kim      50
James    60
Ann      30
Kelly    20
Skye     40
dtype: int64

#  df['column']

In [2]:
# name 컬럼만 가져오기
print(df['name'])

0      Alice
1        Bob
2    Charlie
3      David
Name: name, dtype: object

# df.loc[] — 라벨 기반 인덱싱

In [11]:
df.head(5)

      name  age     city
0    Alice   25    Seoul
1      Bob   30    Busan
2  Charlie   35  Incheon
3    David   40    Daegu

In [8]:
# 2번째 행 (인덱스 2) 전체 가져오기
print(df.loc[2])

name    Charlie
age          35
city    Incheon
Name: 2, dtype: object

In [9]:
# 특정 행과 열 (2번째 행, 'name' 열)
print(df.loc[2, 'name'])

Charlie

In [10]:
# 여러 행과 열
print(df.loc[[1, 3], ['name', 'city']])

    name   city
1    Bob  Busan
3  David  Daegu

# df.iloc[] — 정수 기반 인덱싱

In [6]:
df.head(5)

      name  age     city
0    Alice   25    Seoul
1      Bob   30    Busan
2  Charlie   35  Incheon
3    David   40    Daegu

In [4]:
# 2번째 행
print(df.iloc[2])

name    Charlie
age          35
city    Incheon
Name: 2, dtype: object

In [5]:
# 2번째 행, 0번째 열
print(df.iloc[2, 0])

Charlie

In [7]:
# 여러 행과 열
print(df.iloc[[1, 3], [0, 2]])

    name   city
1    Bob  Busan
3  David  Daegu

# df.drop() — 행 또는 열 삭제

In [13]:
df.head(5)

      name  age     city
0    Alice   25    Seoul
1      Bob   30    Busan
2  Charlie   35  Incheon
3    David   40    Daegu

In [12]:
# 행 삭제 (index 1)
df_dropped_row = df.drop(index=1)
print(df_dropped_row)

      name  age     city
0    Alice   25    Seoul
2  Charlie   35  Incheon
3    David   40    Daegu

In [14]:
# 열 삭제 ('city' 컬럼)
df_dropped_col = df.drop(columns='city')
print(df_dropped_col)

      name  age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   40

In [15]:
# inplace=True 사용 시 원본 df가 수정됨
df.drop(index=0, inplace=True)
print(df)

      name  age     city
1      Bob   30    Busan
2  Charlie   35  Incheon
3    David   40    Daegu